{
  "versions": [
    {
      "version": "1.6.0",
      "changes": [
        "Introduced a brand new interface.",
        "Fixed issue with disabled global custom timestamp functionality.",
        "Added ability to generate JSON with images included.",
        "Now supports exporting and loading JSON from custom directories."
      ]
    },
    {
      "version": "1.5.0",
      "changes": [
        "Added a new tab for game search functionality.",
        "Implemented in-app update checking system.",
        "Optimized interface for improved performance and lighter experience.",
        "General bug fixes and refinements."
      ]
    },
    {
      "version": "1.4.0",
      "changes": [
        "Integrated new Hydra API as default method.",
        "No need to generate a Steam key anymore — although manual switching is still available in settings.",
        "Various bug fixes and improvements."
      ]
    },
    {
      "version": "1.3.0",
      "changes": [
        "Added support for multiple game directory structures: OnlineFix, RLD!, Codex, Rune (automatic recognition).",
        "Note: OnlineFix support may be unstable due to potential Hydra bugs.",
        "Implemented achievement loading from existing directories."
      ]
    },
    {
      "version": "1.2.0",
      "changes": [
        "Fixed: Duplicate achievements issue in the manager UI and bugs during achievement generation.",
        "Improved: Detection and display system to prevent duplicate achievements.",
        "Optimized: Achievement file processing to ensure unique entries."
      ]
    },
    {
      "version": "1.1.0",
      "changes": [
        "Added multi-language support: PT-BR, EN-US, ES-ES, RU, UK, IT.",
        "Introduced Game Manager: new section with achievement progress and quick navigation.",
        "Redesigned interface for a more modern, intuitive, and customizable experience.",
        "Optimized overall performance.",
        "Full translation implemented."
      ]
    },
    {
      "version": "1.0.0",
      "changes": [
        "Stable release of Hydra Achievements Manager.",
        "A tool designed to manage and unlock achievements in Hydra."
      ]
    }
  ]
}
